[
  {
    "id": "gambit-port-internal-fd-inspector",
    "title": "Inspect Gambit port's internal file descriptor number",
    "description": "Add a tool or gerbil_eval helper that extracts the internal file descriptor number from a Gambit port object. Gambit ports wrap raw fds but don't expose them via public API. This is critical when debugging fd/port dual-layer issues (e.g., redirect offset divergence, pipe lifecycle, sendto failures after dup2). Currently requires guessing or using /proc/self/fd enumeration.",
    "impact": "medium",
    "tags": [
      "gambit",
      "port",
      "fd",
      "internal",
      "inspect",
      "file-descriptor",
      "debug"
    ],
    "use_case": "When debugging I/O issues where Gambit ports and raw fds interact (redirects, pipes, fork+exec), knowing which fd a port actually uses is essential for understanding offset divergence, dup2 effects, and pipe reference counting.",
    "example_scenario": "After redirecting fd 1 to a file and creating a new Gambit port, we needed to know the port's internal fd to understand why builtin output was overwriting external command output. Had to reason through Gambit internals instead of just inspecting the port's fd number.",
    "estimated_token_reduction": "~300 tokens per debugging session by eliminating guesswork about which fd a port uses",
    "votes": 0
  },
  {
    "id": "gambit-source-version-extract",
    "title": "Extract matching Gambit source tree for current Gerbil installation",
    "description": "A tool that identifies the exact Gambit commit Gerbil was built with (from gsc -v output) and extracts the matching source tree (gsc/ and lib/ directories) from a Gambit git repository. This is needed when embedding gambitgsc modules into a Gerbil executable, where source files MUST match the exact Gambit version to avoid struct incompatibilities and missing macros.",
    "impact": "low",
    "tags": [
      "gambit",
      "version",
      "source",
      "extract",
      "embed",
      "gsc",
      "compile-file"
    ],
    "use_case": "When embedding the Gambit compiler backend (compile-file from libgambitgsc.a) into a Gerbil executable. The gambitgsc .scm source files must be from the exact same Gambit commit that Gerbil was built with, otherwise you get exit code 71 or missing macro errors.",
    "example_scenario": "Building gsh (Gerbil shell) with embedded compile-file required manually checking gsc -v, parsing the commit hash, running git archive against the Gambit repo, and extracting to a temp directory. This multi-step process is error-prone and could be automated.",
    "estimated_token_reduction": "~200 tokens per embedding build session by automating version matching",
    "votes": 0
  }
]
